@extends('layouts')

@section('main_content')

<!---------------------------------------------------------- Главные Новости ---------------------------------------------------------->
@include('home_categories', ['newsDatas' => $newsDataGeneral])



<!---------------------------------------------------------- Новости Бизнеса ---------------------------------------------------------->
@include('home_categories', ['newsDatas' => $newsDataBusiness])


<!---------------------------------------------------------- Новости Развлечений ---------------------------------------------------------->
@include('home_categories', ['newsDatas' => $newsDataEntertainment])


<!---------------------------------------------------------- Новости Здоровья ---------------------------------------------------------->
@include('home_categories', ['newsDatas' => $newsDataHealth])


<!---------------------------------------------------------- Новости Науки ---------------------------------------------------------->
@include('home_categories', ['newsDatas' => $newsDataScience])


<!---------------------------------------------------------- Новости Спорта ---------------------------------------------------------->
@include('home_categories', ['newsDatas' => $newsDataSports])


<!---------------------------------------------------------- Новости Технологий ---------------------------------------------------------->
@include('home_categories', ['newsDatas' => $newsDataTechnology])

@endsection